УТ_для_edt/src/InformationRegisters/смартБонусыИнженеров/смартБонусыИнженеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартБонусыИнженеров</name>
  <comment>//++ #Б-5132 смарт: Фролов 03.12.2025 //Создание механизма учета выплат инженерам по демонстрациям.</comment>
  <resources>
    <name>СуммаВыручки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусНачисленный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусВыплаченный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусВыплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникБонусов</name>
    <type>
      <types>DocumentRef.МаркетинговыеМероприятияДокумент</types>
      <types>CatalogRef.смартИсточникиРекламногоВоздействия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовКлиентов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовКлиентов</types>
      <types>EnumRef.СостоянияЗаявокНаВозвратТоваровОтКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДокументыПодписаны</name>
    <comment>//++ #1650 смарт:Шляпников 17.09.2024 //Отметка &quot;Оригиналы документов получены&quot; (Заказ клиента) при частичной отгрузке (1650)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставке</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитанаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеПоТарифу</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСуммаПоТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартИсточникиРекламногоВоздействия/смартИсточникиРекламногоВоздействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартИсточникиРекламногоВоздействия</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Канал</name>
    <comment>#1462 смарт: Фролов 04.12.2024 / ИМ. Разделение лидов по источникам</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешеноИспользоватьВЗаказеКлиента</name>
    <comment>//++ #Б-3864 смарт: Фролов 17.07.2025 //Выбор в заказе клиента только разрешенных Источников рекламного взаимодействия. </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>//++ #Б-4932 смарт: Фролов 10.11.2025 //Доработка справочника Источники рекламного взаимодействия. </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>//++ #Б-4932 смарт: Фролов 10.11.2025 //Доработка справочника Источники рекламного взаимодействия. </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОборудованиеИОператоры</name>
    <comment>//++ #Б-4932 смарт: Фролов 07.11.2025 //Доработка справочника Источники рекламного взаимодействия.</comment>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Оператор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <comment>//++ #Б-4962 смарт: Фролов 12.11.2025 //Доработка справочника Источники Рекламного взаимодействия.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <comment>//++ #Б-5018 смарт: Фролов 19.11.2025 //Корректировка справочника Источники Рекламного взаимодействия</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АвтоматическоеПроставлениеВЗаказеКлиента</name>
    <comment>//++ #Б-6636 смарт: Фролов 22.04.2026 //В спр.Партнеры реализовать возможность отражения посещения наших мероприятий/выставок.</comment>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Марки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/смартБонусыИнженеров/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	//Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КурсыВалют.Период КАК Период,
	|	КурсыВалют.Курс КАК Курс
	|ПОМЕСТИТЬ КурсыЕВРО
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Валюта = &EUR
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалют.Период КАК Период,
	|	КурсыВалют.Курс КАК Курс
	|ПОМЕСТИТЬ КурсыДоллар
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Валюта = &USD
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалют.Период КАК Период,
	|	КурсыВалют.Курс КАК Курс
	|ПОМЕСТИТЬ КурсыЮань
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Валюта = &CNY
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартИсточникиРекламногоВоздействияОборудованиеИОператоры.Партнер КАК Партнер,
	|	смартИсточникиРекламногоВоздействияОборудованиеИОператоры.Оборудование КАК Оборудование,
	|	смартИсточникиРекламногоВоздействияОборудованиеИОператоры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПартнерыВИсточниках
	|ИЗ
	|	Справочник.смартИсточникиРекламногоВоздействия.ОборудованиеИОператоры КАК смартИсточникиРекламногоВоздействияОборудованиеИОператоры
	|ГДЕ
	|	НЕ смартИсточникиРекламногоВоздействияОборудованиеИОператоры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаТовары.РекламноеВоздействие КАК ИсточникБонусов,
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЕСТЬNULL(ОборудованиеИОператорыБезПартнера.Оператор, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Сотрудник,
	|	ЗаказКлиентаТовары.Номенклатура КАК Оборудование,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &EUR
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыЕВРО.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &USD
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыДоллар.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &CNY
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыЮань.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &RUR
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС
	|		ИНАЧЕ ЗаказКлиентаТовары.СуммаСНДС
	|	КОНЕЦ КАК СуммаВыручки,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &EUR
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыЕВРО.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &USD
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыДоллар.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &CNY
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыЮань.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &RUR
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС
	|		ИНАЧЕ ЗаказКлиентаТовары.СуммаСНДС
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ЕСТЬNULL(ОборудованиеИОператорыБезПартнера.Оператор, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ОборудованиеИОператорыБезПартнера.Процент
	|	КОНЕЦ / 100 КАК БонусНачисленный
	|ПОМЕСТИТЬ ПредварительныеЛанные
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыЕВРО КАК КурсыЕВРО
	|		ПО (НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ) = КурсыЕВРО.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыДоллар КАК КурсыДоллар
	|		ПО (НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ) = КурсыДоллар.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыЮань КАК КурсыЮань
	|		ПО (НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ) = КурсыЮань.Период)
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.смартИсточникиРекламногоВоздействия.ОборудованиеИОператоры КАК ОборудованиеИОператорыБезПартнера
	|		ПО (ОборудованиеИОператорыБезПартнера.Ссылка = ЗаказКлиентаТовары.РекламноеВоздействие)
	|			И ЗаказКлиентаТовары.Номенклатура = ОборудованиеИОператорыБезПартнера.Оборудование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ЗаказКлиентаТовары.Ссылка = СостоянияЗаказовКлиентов.Заказ
	|ГДЕ
	|	ЗаказКлиентаТовары.РекламноеВоздействие В
	|			(ВЫБРАТЬ
	|				ПартнерыВИсточниках.Ссылка
	|			ИЗ
	|				ПартнерыВИсточниках)
	|	И ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И СостоянияЗаказовКлиентов.ПроцентОплаты > 0
	|	И ОборудованиеИОператорыБезПартнера.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И НЕ (ЗаказКлиентаТовары.Номенклатура, ЗаказКлиентаТовары.Ссылка.Партнер) В
	|				(ВЫБРАТЬ
	|					ПартнерыВИсточниках.Оборудование,
	|					ПартнерыВИсточниках.Партнер
	|				ИЗ
	|					ПартнерыВИсточниках)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.РекламноеВоздействие,
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЕСТЬNULL(ОборудованиеИОператорыСПартнером.Оператор, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)),
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &EUR
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыЕВРО.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &USD
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыДоллар.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &CNY
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыЮань.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &RUR
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС
	|		ИНАЧЕ ЗаказКлиентаТовары.СуммаСНДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &EUR
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыЕВРО.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &USD
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыДоллар.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &CNY
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС * ЕСТЬNULL(КурсыЮань.Курс, 1)
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Валюта = &RUR
	|			ТОГДА ЗаказКлиентаТовары.СуммаСНДС
	|		ИНАЧЕ ЗаказКлиентаТовары.СуммаСНДС
	|	КОНЕЦ * ОборудованиеИОператорыСПартнером.Процент / 100
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыЕВРО КАК КурсыЕВРО
	|		ПО (НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ) = КурсыЕВРО.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыДоллар КАК КурсыДоллар
	|		ПО (НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ) = КурсыДоллар.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыЮань КАК КурсыЮань
	|		ПО (НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ) = КурсыЮань.Период)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ЗаказКлиентаТовары.Ссылка = СостоянияЗаказовКлиентов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартИсточникиРекламногоВоздействия.ОборудованиеИОператоры КАК ОборудованиеИОператорыСПартнером
	|		ПО ЗаказКлиентаТовары.РекламноеВоздействие = ОборудованиеИОператорыСПартнером.Ссылка
	|			И ЗаказКлиентаТовары.Номенклатура = ОборудованиеИОператорыСПартнером.Оборудование
	|			И ЗаказКлиентаТовары.Ссылка.Партнер = ОборудованиеИОператорыСПартнером.Партнер
	|ГДЕ
	|	ЗаказКлиентаТовары.РекламноеВоздействие В
	|			(ВЫБРАТЬ
	|				ПартнерыВИсточниках.Ссылка
	|			ИЗ
	|				ПартнерыВИсточниках)
	|	И ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И СостоянияЗаказовКлиентов.ПроцентОплаты > 0
	|	И НЕ ОборудованиеИОператорыСПартнером.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныеЛанные.ИсточникБонусов КАК ИсточникБонусов,
	|	ПредварительныеЛанные.ЗаказКлиента КАК ЗаказКлиента,
	|	ПредварительныеЛанные.Сотрудник КАК Сотрудник,
	|	ПредварительныеЛанные.Оборудование КАК Оборудование,
	|	ПредварительныеЛанные.СуммаВыручки КАК СуммаВыручки,
	|	ПредварительныеЛанные.БонусНачисленный КАК БонусНачисленный
	|ИЗ
	|	ПредварительныеЛанные КАК ПредварительныеЛанные
	|ГДЕ
	|	НЕ ПредварительныеЛанные.Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)"); 
	Запрос.УстановитьПараметр("CNY", Справочники.Валюты.НайтиПоКоду("156"));
	Запрос.УстановитьПараметр("EUR", Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("USD", Справочники.Валюты.НайтиПоКоду("840"));
	Запрос.УстановитьПараметр("RUR", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.смартБонусыИнженеров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИсточникБонусов.Установить(Выборка.ИсточникБонусов);
		НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
		НаборЗаписей.Отбор.ЗаказКлиента.Установить(Выборка.ЗаказКлиента);
		НаборЗаписей.Отбор.Оборудование.Установить(Выборка.Оборудование);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			СтрНаборЗаписей = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрНаборЗаписей, Выборка);
			НаборЗаписей.Записать(Истина);
			
		ИначеЕсли НЕ НаборЗаписей[0].БонусВыплачен Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей[0], Выборка);
			НаборЗаписей.Записать(Истина);				
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Выплатить(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", Элементы.Список.ТекущаяСтрока);
	ПараметрыОткрытия.Вставить("ПланируетсяВыплата", Истина);
	
	Оповещение = Новый ОписаниеОповещения("смартОбновитьСписокПослеУстановкиВыплаты", ЭтаФорма);
	
	ОткрытьФорму("РегистрСведений.смартБонусыИнженеров.Форма.ФормаЗаписи", ПараметрыОткрытия, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаКлиенте
Процедура смартОбновитьСписокПослеУстановкиВыплаты(Значение, ДопПараметры) Экспорт
	
	Элементы.Список.Обновить();	

КонецПроцедуры
